[
  {
    "doi": "10.37934/araset.48.1.137151",
    "publication": "Journal of Advanced Research in Applied Sciences and Engineering Technology",
    "title": "Enhanced Generalization Performance in Deep Learning for Monitoring Driver Distraction: A Systematic Review",
    "author": "Joel John M.",
    "publish_date": "2025-06-01",
    "abstract": "Automatic analysis of driver behaviour is one of the most difficult subjects in the field of intelligent transportation systems. This study focuses on disturbed driver stance identification as part of the human action recognition methodology. Distracted drivers have been blamed for several vehicle crashes. Several research projects attacked the issue using various ways, including the use of invasive detectors, which are not practicable for mass production. The majority of the research done in the early 2010s relied on typical Machine Learning algorithms to complete the identification function. Many studies have been performed since the development of DL techniques to accomplish attention identification utilizing Neural Networks. Additionally, most of the study in the field has been done in a simulator or lab context, and the suggested system has not been validated in an actual situation. Most crucially, the field's study activities could be further separated into numerous sections. Many training methods, model properties, & feature choice parameters have been evaluated in this work, which seeks to give a comprehensive evaluation of machine learning methodologies employed for identifying driving distractions.",
    "synopsis": null,
    "relevance": null,
    "url": "https://doi.org/10.37934/araset.48.1.137151"
  },
  {
    "doi": "10.1201/9781003466383-13",
    "publication": "Next Generation Computing and Information Systems - Proceedings of the 2nd International Conference on Next-Generation Computing and Information Systems, ICNGCIS 2023",
    "title": "IOT and developed deep learning based road accident detection system and societal knowledge management",
    "author": "Ananth K.R.",
    "publish_date": "2025-01-01",
    "abstract": "Business organizations and the research community try to precisely detect occurrences and assist in the case of a disaster. Most development systems are hardware-based, making them pricey and unavailable in every vehicle. A vehicle’s sensors can be destroyed in various ways, including minor accidents or fixed interactions. In instances, the sensors are incapable of detecting an accident. Intelligent phone sensors are a great alternative because of their dependability and availability. The study involves creating a smartphone application that continually reads sensor data and sends it to the cloud. The crash is discovered by threshold analysis. The critical novelty of this research is creating a scheme that alerts nearby hospitals and ambulances when an accident occurs. The system will have more minor inaccuracies, precisely identify accidents, and perform better than earlier techniques using four sensory inputs. This paper introduced novel types of deep learning for accident detection.",
    "synopsis": null,
    "relevance": null,
    "url": "https://doi.org/10.1201/9781003466383-13"
  },
  {
    "doi": "10.1016/j.csi.2024.103876",
    "publication": "Computer Standards and Interfaces",
    "title": "BLPCA-ledger: A lightweight plenum consensus protocols for consortium blockchain based on the hyperledger indy",
    "author": "Mehmood F.",
    "publish_date": "2025-01-01",
    "abstract": "An examination of different distributed real-time applications operating on the blockchain platform is conducted. These applications can be broadly classified into three types: permissionless public, permissioned private, and consortium chains. In order for a decentralized network to function independently, consensus mechanisms are needed to facilitate the delivery of transactions and keep track of them in a ledger. But the fundamental idea behind Blockchain technology is the use of several consensus protocols, like Proof of Stake, Proof of Elapsed Time, etc., which requires greater processing power. In order to arrange transactions, it increases the demand for buying more computing units. Furthermore, present consortia blockchain consensus mechanisms lack a policy to collect socio-economic financial levies, including monies for charitable donations, education, and social activities. To collect socio-economic taxes, this study suggests a lightweight Plenum consensus algorithm called \"BLPCA\" for consortium blockchains built on Hyperledger Indy. The Byzantine Fault Tolerance concept combined with optimization is used in the suggested BLPCA systems to manage large-scale decentralized traffic of socioeconomic hierarchy. Because there are no transaction costs, BLPCA encourages government analysts to review funds using fewer resources. By including a multithreading heterogeneous technique, the BLPCA can effectively handle multi-transaction needs and execute this protocol in an industrial setting that operates in real-time. It is observed from the simulations that even in the worst-case network scenario—such as a fork—the suggested consortium blockchain does not crash a single transaction. In order to guarantee node scalability, a high propagation speed is determined. Furthermore, the BLPCA shows an excellent average time while constructing socioeconomic transaction blocks.",
    "synopsis": null,
    "relevance": null,
    "url": "https://doi.org/10.1016/j.csi.2024.103876"
  },
  {
    "doi": "10.1057/s41599-024-03521-4",
    "publication": "Humanities and Social Sciences Communications",
    "title": "CSR decoupling and stock price crash risk: Evidence from China",
    "author": "Wan P.",
    "publish_date": "2024-12-01",
    "abstract": "This paper examines the efficacy of corporate social responsibility (CSR) decoupling on stock price crash risk (SPCR). Selecting Chinese listed companies over the 2010–2019 period as a sample, we find that CSR decoupling exacerbates SPCR, and this relationship still holds after a battery of endogeneity and robustness tests. Further analysis reveals that within companies characterized by higher agency risks, CSR decoupling exacerbates SPCR more significantly, suggesting the role of information asymmetry as a crucial mechanism through which CSR decoupling influences SPCR. Our results show CSR decoupling’s harm on the capital market and help clarify mixed evidence in existing studies.",
    "synopsis": null,
    "relevance": null,
    "url": "https://doi.org/10.1057/s41599-024-03521-4"
  },
  {
    "doi": "10.1038/s41598-024-68263-4",
    "publication": "Scientific Reports",
    "title": "Generalization of cut-in pre-crash scenarios for autonomous vehicles based on accident data",
    "author": "Li P.",
    "publish_date": "2024-12-01",
    "abstract": "The utilization of high-risk test cases constitutes an effective approach to enhance the safety testing of autonomous vehicles (AVs) and enhance their efficiency. This research paper presents a derivation of 2052 high-hazard pre-crash scenarios for testing autonomous driving, which were based on 23 high-hazard cut-in accident scenarios from the National Automobile Accident In-Depth Investigation System (NAIS) through combining importance sampling and combined testing methods. Compared to the direct combination of the original distribution after sampling, the proposed method has a 2.92 times higher crash rate of 69.32% for the test case set in this paper. It also has a 5.8 times higher rate of triggering Automatic Emergency Braking (AEB), improving hazardous scenario coverage. Using the proposed method, the generated parameters of the cut-in accident scenario test set were compared with those of the cut-in test scenarios included in existing Chinese autonomous driving test protocols and standards. The velocity of the ego-vehicle obtained using the proposed method matched those in the existing protocols, whereas the velocity, time gap, and time to collision of the target vehicle were significantly lower than those existing protocols indicating scenarios obtained from accident data can enrich the selection of testing scenarios for autonomous driving.",
    "synopsis": null,
    "relevance": null,
    "url": "https://doi.org/10.1038/s41598-024-68263-4"
  },
  {
    "doi": "10.1186/s12873-024-01048-0",
    "publication": "BMC Emergency Medicine",
    "title": "New Trauma Score versus Kampala Trauma Score II in predicting mortality following road traffic crash: a prospective multi-center cohort study",
    "author": "Damulira J.",
    "publish_date": "2024-12-01",
    "abstract": "Introduction: Mortality due to injuries disproportionately impact low income countries. Knowledge of who is at risk of poor outcomes is critical to guide resource allocation and prioritization of severely injured. Kampala Trauma Score (KTS), developed in 1996 and last modified in 2002 as KTS II, is still widely being used to predict injury outcomes in resource-limited settings with no further revisions in the past two decades, despite ongoing criticism of some of its parameters. The New Trauma Score (NTS), a recent development in 2017, has shown potential in mortality prediction, but a dearth of evidence exist regarding its performance in the African population. Objectives: To compare NTS to the modified Kampala Trauma Score (KTS II) in the prediction of 30-day mortality, and injury severity amongst patients sustaining road traffic crashes in Ugandan low-resource settings. Methods: Multi-center prospective cohort study of patients aged 15 years and above. Of the 194 participants, 85.1% were males with a mean age of 31.7 years. NTS and KTS II were determined for each participant within 30-minutes of admission and followed-up for 30 days to determine their injury outcomes. The sensitivity, specificity, and area under receiver operating characteristics curve (AUC) for predicting mortality were compared between the two trauma scores using SPSS version 22. Ethical clearance: Research and Ethics Committee of Kampala International University Western Campus (Ref No: KIU-2022-125). Results: The injury severity classifications based on NTS vs. KTS II were mild (55.7% vs. 25.8%), moderate (29.9% vs. 30.4%), and severe (14.4% vs. 43.8%). The mortality rates for each injury severity category based on NTS vs. KTS II were mild (0.9% v 0%), moderate (20.7% vs. 5.1%), and severe (50% vs. 28.2%). The AUC was 0.87 for NTS (95% CI 0.808–0.931) vs. 0.86 (95% CI 0.794–0.919) for KTS II respectively. The sensitivity of NTS vs. KTS II in predicting mortality was 92.6% (95% CI: 88.9–96.3) vs. 70.4% (95% CI: 63.0-77.8) while the specificity was 70.7% (95% CI: 64.2–77.2) vs. 78.4% (95% CI: 72.1–84.7) at cut off points of 17 for NTS and 6 for KTS II respectively. Conclusions: NTS was more sensitive but its specificity for purposes of 30-day mortality prediction was lower compared to KTS II. Thus, in low-resourced trauma environment where time constraints and pulse oximeters are of concern, KTS II remains superior to NTS.",
    "synopsis": null,
    "relevance": null,
    "url": "https://doi.org/10.1186/s12873-024-01048-0"
  },
  {
    "doi": "10.1038/s41598-024-68341-7",
    "publication": "Scientific Reports",
    "title": "Research on finite element simulation and full-scale-vehicle crash test of B750HL bridge barrier",
    "author": "Zhang M.",
    "publish_date": "2024-12-01",
    "abstract": "How to raise the bridge barrier with a concrete base height of only 51 cm to SS level of protection is not yet studied. In order to effectively retrofit an existing concrete barrier design to meet new crash testing criteria, the structural dimensions and concrete strength of the existing bridge barrier were investigated, and finite element simulation analysis was carried out, and simulation suggested the existing barrier was insufficient. Based on the structural dimension design principles of bridge barriers, the existing structure of bridge barrier was designed after adding lightweight and high-strength B750HL material crossbeams and posts on top of the concrete base, and the bearing capacity of the bridge barrier was calculated based on the yield line theory. Then, a finite element simulation analysis model was established to study and analyze the blocking, guiding, and cushioning functions of the improved design of bridge barrier. Finally, full-scale-vehicle crash tests were conducted with the SS-level small car, bus, and tractor-van trailer for this bridge barrier design scheme. This paper is the world’s first to use B750HL steel as the material for the crossbeam and post of a bridge barrier with a concrete base height of only 51 cm. According to the research results, the B750HL bridge barrier, which was designed based on the calculation of structural dimension design and yield line theory, effectively reduces the increased constant load on the bridge deck caused by the extra crossbeams and posts. At the same time, it can reduce material costs and save engineering costs. After being verified by finite element simulation crash tests and full-scale-vehicle crash tests, the protective capacity of the B750HL bridge barrier was proven to meet the SS-level evaluation requirements of the Standard for Safety Performance Evaluation of Highway Barriers (JTG B05-01-2013). The research findings of this paper is that the finite element simulation crash tests can effectively simulate full-scale-vehicle crash test, and the finite element simulation crash tests is reliable. If the safety performance of the barrier in the finite element simulation crash tests meets the requirements, the probability of passing the full-scale-vehicle crash test is higher. Therefore, a design scheme is proposed for the B750HL bridge barrier to improve hybrid bridge barriers at a height of 51 cm or more based on various design methods.",
    "synopsis": null,
    "relevance": null,
    "url": "https://doi.org/10.1038/s41598-024-68341-7"
  },
  {
    "doi": "10.1038/s41598-024-67904-y",
    "publication": "Scientific Reports",
    "title": "Direct and indirect costs of parasitism preceding a population decline of an Arctic ungulate",
    "author": "Dickinson E.R.",
    "publish_date": "2024-12-01",
    "abstract": "Parasites negatively affect the fitness of ungulate hosts directly, and in wild ungulates, these effects may be synzootic with other stressors, such as limited nutritional resources. In the Arctic, muskoxen (Ovibos moschatus) occur in a highly seasonal environment and must rely on finite energetic resources for survival and productivity. We investigated the costs of gastrointestinal nematodes on the body condition and reproductive status of 141 muskoxen, on Banks Island, Canada, when the population was at a peak in numbers and density. Using a Partial Least Squares Path Modelling approach, we found that high adult nematode abundance was associated with lower body condition, and high parasite abundance was associated with female reproduction including the indirect effect through on body condition (n = 87). These findings suggest that individuals prioritize energetic reserves for reproduction over parasite defence. In fall 2003, a severe icing event that restricted access to forage was associated with high overwinter mortality of muskoxen and a population crash. Through direct and indirect costs of parasite infection on body condition and reproduction, the high abundance of parasites may have contributed to the effects of this extreme weather event. Understanding the mechanisms in which parasites impact fitness can help explain the ecological drivers of ungulate populations and predict the interactions between the environment and populations.",
    "synopsis": null,
    "relevance": null,
    "url": "https://doi.org/10.1038/s41598-024-67904-y"
  },
  {
    "doi": "10.1186/s40621-024-00516-2",
    "publication": "Injury Epidemiology",
    "title": "The association between county ordinances allowing off-road vehicles on public roads and crash rates",
    "author": "Monson C.D.",
    "publish_date": "2024-12-01",
    "abstract": "Background: Legislative bodies across the country have increasingly allowed off-road vehicles (ORVs) including all-terrain vehicles (ATVs) and utility task vehicles (UTVs) on public roads, an environment for which they are not designed. In 2004, Iowa gave individual counties the discretion to pass ordinances allowing ORVs on public roadways. The objective of this study was to evaluate the relationship between the passage of ORV ordinances and ORV crash rates, especially on public roads. Methods: An Iowa ORV roadway ordinance database and an Iowa ORV crash database (2002–2018) for all 99 counties were compiled. Crashes for which county location could not be determined were excluded. Utilizing a zero-inflated Poisson model, correcting for background crash frequency trends and population, investigators compared the relative rates of crashes after ordinance passage to time points before ordinance implementation and to counties without such ordinances. Sub-analyses, including that focused on more recent years (2008–2018), were also performed. Results: Forty-five county ORV roadway ordinances went into effect between 2011 and 2018 and 2,347 crashes (69%) met inclusion criteria. Adjusted for year, there was a 58% greater ORV crash rate in counties after passing an ORV roadway ordinance (incidence rate ratio (IRR) 1.58, 95% CI 1.32–1.90). Roadway crashes (n = 834) increased 48% after ordinance passage (IRR 1.48, 95% CI 1.14–1.94). This roadway crash association remained statistically significant when analysis was limited to the years 2008–2018 (IRR 1.39, CI 1.06–1.83, n = 544); to ATV crashes only (IRR 1.70, CI 1.20–2.40, n = 683); and to ATV crashes excluding counties with UTV-only ordinances (IRR 1.74, CI 1.40–2.15, n = 2,011). Conclusions: ORV roadway and total crashes increased significantly after implementation of county ordinances allowing ORVs on public roadways and when compared to counties without such ordinances. It is likely that these increased crashes have resulted in more injuries and possibly deaths. Results from this study may help inform policymakers as they consider legislation regarding ORV usage on public roads.",
    "synopsis": null,
    "relevance": null,
    "url": "https://doi.org/10.1186/s40621-024-00516-2"
  },
  {
    "doi": "10.1016/j.amar.2024.100347",
    "publication": "Analytic Methods in Accident Research",
    "title": "Stochastic method based on copulas for predicting severe road traffic interactions",
    "author": "Chen Z.",
    "publish_date": "2024-12-01",
    "abstract": "A major difficulty in assessing road traffic safety is the scarcity of historical accident data. xxThis is a common problem in contexts where a certain level of safety has been reached or where exposure is low, such as mixed traffic conditions with different levels of transport automation. Recent studies have demonstrated how severe interactions between road users and/or road users and infrastructure can be a direct measure of safety. However, limiting the investigation to only the most extreme events may lead to inconclusive results considering the lack of prediction robustness and the possible selection bias. In this context, extreme value theory (EVT) is commonly used to extrapolate crashes from road traffic interactions, even combining several indicators. The present work extends the EVT paradigm by proposing a method based on copula functions and EVT, which enables a more specific and continuous evaluation of interaction severity. Compared with pure EVT, this new approach extends the boundary to interactions of all severities while implicitly assuming that the relationship between safety-relevant events and road casualties is stochastic. This EVT-copula approach was also compared with bivariate peaks over threshold (BPOT). It was found that the two approaches yield similar prediction results for crash probabilities. Furthermore, the proposed approach applies to events not properly defined in BPOT and provides more accurate predictions for severe (and less severe) interactions compared with BPOT, when benchmarked against observations.",
    "synopsis": null,
    "relevance": null,
    "url": "https://doi.org/10.1016/j.amar.2024.100347"
  },
  {
    "doi": "10.1186/s12544-024-00654-0",
    "publication": "European Transport Research Review",
    "title": "Impact analysis of Advanced Driver Assistance Systems (ADAS) regarding road safety – computing reduction potentials",
    "author": "Aleksa M.",
    "publish_date": "2024-12-01",
    "abstract": "In the present study road safety impact analysis for certain advanced driver assistance systems (ADAS) was conducted. Based on a literature review, expert interviews and current adaptations in legislation, the most promising nine ADAS were selected. The impact was analysed based on statistical crash data from Austria. Factors such as infrastructure and weather conditions, market penetration, expected functionality of sensors, user acceptance and risk homeostasis were considered. A software tool was developed to calculate the crash reduction potential of the selected ADAS for the scenarios 2025, 2030 and 2040. The results show that the ADAS related to warning/braking have the greatest future reduction potential and could lead to a reduction of up to 8,700 crashes and 70 fatalities in Austria in 2040. In addition, the Intelligent Speed Assistance system would lead to an overall crash reduction of 8% compared to current crash numbers in Austria in 2040. The Turning Assistant for heavy goods vehicles shows the lowest reduction in crashes and casualties, but due to the highest severity per crash (93 fatalities per 1,000 crashes), it nevertheless provides an important contribution to the reduction of fatalities in road traffic. However, to benefit from the ADAS safety potential, it is highly relevant that these systems are used in a correct manner. In the future, it will be necessary to provide users with more information on the correct use, benefits and limitations of the respective ADAS and to integrate the use of these systems into driver education procedures and tests.",
    "synopsis": null,
    "relevance": null,
    "url": "https://doi.org/10.1186/s12544-024-00654-0"
  },
  {
    "doi": "10.1038/s41598-024-66090-1",
    "publication": "Scientific Reports",
    "title": "Lifetime cost analysis of concrete barriers and steel guardrails",
    "author": "Nemati A.",
    "publish_date": "2024-12-01",
    "abstract": "This study investigates the lifetime costs associated with concrete barriers and steel guardrails. We introduce a cost analysis methodology that incorporates critical factors such as construction costs, maintenance costs, exposure risks during maintenance activities, and the costs imposed to traveling public through the increased traffic and the crash outcomes. We integrate various parameters including economic factors, road geometry, general weather condition, and traffic mix to estimate a location-dependent cost for each type of barrier accurately. A software tool, named CalBarrier, was developed during this study to carry out the calculations and the comparison of lifetime cost of aforementioned barriers. An inherent strength of this research is its reliance on recent real data extracted from various databases of California Department of Transportation (Caltrans), ensuring precision and relevance in accounting for various influential factors. Drawing insights from Caltrans practices and interviews with their personnel, this study emphasizes the intricate decision-making process involved in mitigating safety risks and reducing operational expenses. Although our data originates from California, the methodology for life cycle cost analysis, and our software are applicable for regions with different socio-economic conditions by deploying user input costs, making our findings a valuable resource for other areas facing comparable challenges.",
    "synopsis": null,
    "relevance": null,
    "url": "https://doi.org/10.1038/s41598-024-66090-1"
  },
  {
    "doi": "10.1016/j.future.2024.06.028",
    "publication": "Future Generation Computer Systems",
    "title": "A read-efficient and write-optimized hash table for Intel Optane DC Persistent Memory",
    "author": "Li Z.",
    "publish_date": "2024-12-01",
    "abstract": "Emerging non-volatile memory technologies are driving the next generation of storage systems and durable data structures. Among them, many hash table proposals employ NVM as the storage layer for both fast access and efficient persistence. Most of them are based on the assumption that NVM has cacheline access granularity, poor write endurance, DRAM-comparable read latency and relatively higher write latency. However, a commercial non-volatile memory product, namely Intel Optane DC Persistent Memory (Optane), has some interesting features that are different from previous assumptions, such as 256-byte OptaneLine access granularity, higher read latency than DRAM and DRAM-comparable write latency, limited read/write bandwidth, and hardware-layer wear-leveling. Confronted with the new challenges brought by Optane, we propose Rewo-Hash, a novel read-efficient and write-optimized persistent hash table. Our incremental contributions over our previous work are summarized as follows. First, provide a more detailed technical description for cached table-inclined read mechanism and log-free atomic write mechanism. Second, we devise a consistent shadowing synchronization scheme to mask the data synchronization overhead. Third, we propose a non-blocking lightweight resizing scheme and elaborate the crash recovery mechanism. Fourth, we conduct a comprehensive analysis of the implications of Intel ceasing the production of Optane, and provide a forward-looking perspective on the future of non-volatile memory. The experimental results show that compared with state-of-the-art NVM-Optimized hash tables, Rewo-Hash gains remarkable performance improvement.",
    "synopsis": null,
    "relevance": null,
    "url": "https://doi.org/10.1016/j.future.2024.06.028"
  },
  {
    "doi": "10.1186/s40621-024-00506-4",
    "publication": "Injury Epidemiology",
    "title": "Cervical vertebral and spinal cord injuries in rollover occupants",
    "author": "Al-Salehi L.",
    "publish_date": "2024-12-01",
    "abstract": "Background: Rollover crashes continue to be a substantial public health issue in North America. Previous research has shown that the cervical spine is the most injured spine segment in rollovers, but much of the past research has focused on risk factors rather than the actual cervical spine injuries. We sought to examine how different types of cervical spine injuries (vertebral and/or cord injury) vary with different occupant-related factors in rollovers and to compare these with non-rollovers. Methods: We obtained crash and injury information from the National Automotive Sampling System–Crashworthiness Data System (NASS-CDS) for 2005–2015 and Crash Investigation Sampling System (CISS) for 2017–2022. Based on weighted data, we calculated relative risks to assess how occupant sex, seat belt use, ejection status, and fatal outcome relate to the rate of different cervical spine injuries in rollovers and non-rollovers. Results: In NASS-CDS occupants with cervical spine injuries (N = 111,040 weighted cases), about 91.5% experienced at least one vertebral injury whereas only 11.3% experienced a spinal cord injury (most of which had a concomitant vertebral fracture). All types of cervical spine injuries we examined were 3.4–5.2 times more likely to occur in rollovers compared to non-rollovers. These relative risks were similar for both sexes, belted and unbelted, non-ejected, and non-fatal occupants. The number of weighted CISS occupants with cervical spine injuries (N = 42,003) was smaller than in the NASS analysis, but cervical spine injuries remained 6.25 to 6.36 times more likely in rollovers compared to non-rollovers despite a more modern vehicle fleet. Conclusions: These findings underscore the continued need for rollover-specific safety countermeasures, especially those focused on cervical spine injury prevention, and elucidate the frequency, severity and other characteristics of the specific vertebral and spinal cord injuries being sustained in rollovers. Our findings suggest that countermeasures focused on preventing cervical vertebral fractures will also effectively prevent most cervical spinal cord injuries.",
    "synopsis": null,
    "relevance": null,
    "url": "https://doi.org/10.1186/s40621-024-00506-4"
  },
  {
    "doi": "10.1057/s41599-024-03069-3",
    "publication": "Humanities and Social Sciences Communications",
    "title": "Exploring the impact of customer concentration on stock price crash risk",
    "author": "Afghahi M.",
    "publish_date": "2024-12-01",
    "abstract": "This paper, rooted in agency theory, explores the intricate relationship between stock price crash risk and customer concentration within the context of Iran, a developing nation. Utilising innovative indicators to measure corporate and government customers, we address inconsistent findings in existing research and offer fresh insights into stock price crash risk dynamics. Focusing on 82 companies listed on the Tehran Stock Exchange from 2013 to 2020, our study employs a robust methodological framework, including panel data, multiple regression and three distinct metrics to measure customer concentration. Specifically, we introduce the proportion of significant customer sales, the Herfindahl-Hirschman Index, and a Ranking Index based on substantial customer sales. Our investigation reveals a noteworthy inverse relationship between the highest concentration level of corporate customer concentration, as measured by the Ranking Index, and stock price crash risk. Similarly, we establish an inverse association between the Ranking Index for government customer concentration and stock price crash risk. Moreover, institutional investors positively influence the correlation between corporate customer concentration and stock price crash risk but do not exert a discernible impact on the relationship between government customer concentration and stock price crash risk.",
    "synopsis": null,
    "relevance": null,
    "url": "https://doi.org/10.1057/s41599-024-03069-3"
  },
  {
    "doi": "10.1186/s41235-024-00569-3",
    "publication": "Cognitive Research: Principles and Implications",
    "title": "Different deployments of attentional breadth selectively predict UFOV task performance in older adults",
    "author": "Wyche N.J.",
    "publish_date": "2024-12-01",
    "abstract": "The Useful Field of View task (UFOV) is a strong and reliable predictor of crash risk in older drivers. However, while the functional domain of attention is clearly implicated in UFOV performance, the potential role of one specific attentional process remains unclear: attentional breadth (the spatial extent of the attended region around the point of visual fixation). The goal of the present study was to systematically test the role of two distinct aspects of attentional breadth, maintaining a specific breadth of attention and resizing the attended region, in UFOV performance. To this end, 135 older adults completed the UFOV and modified Navon tasks to measure their efficiency in maintaining, contracting, and expanding the breadth of attention. We then examined individual-difference associations between these aspects of attentional breadth deployment and UFOV performance. We found that performance on UFOV Subtask 2 was associated with efficient contraction of attentional breadth (i.e., resizing the attended region to a smaller area), while Subtask 3 performance was associated with the efficiency of expanding attentional breadth (i.e., resizing the attended region to a larger area). The selectivity of these relationships appears to implicate these specific deployments of attentional breadth in how people complete the task, as it suggests that these relationships are not simply attributable to shared variance in a broader domain of cognitive functioning. The implications of these results for our understanding of UFOV, as well as future research directions that test the relative contributions of different cognitive processes in predicting task performance, are discussed.",
    "synopsis": null,
    "relevance": null,
    "url": "https://doi.org/10.1186/s41235-024-00569-3"
  },
  {
    "doi": "10.1016/j.eswa.2024.124569",
    "publication": "Expert Systems with Applications",
    "title": "DQN-based ethical decision-making for self-driving cars in unavoidable crashes: An applied ethical knob",
    "author": "Vakili E.",
    "publish_date": "2024-12-01",
    "abstract": "Ethical decision-making in complex urban driving scenarios remains a challenge, particularly when human lives are at risk. This paper presents an ethical decision-making model for self-driving cars in critical urban traffic situations, utilizing deep reinforcement learning (DQN algorithm). The primary objective is to minimize injuries resulting from self-driving car crashes. Crash injury severity prediction models are incorporated to design a proper reward function as well as accounting for the age groups of individuals involved in the crash. It explores seven levels from egoism to altruism, investigating the adjustability and sensitivity of the “ethical knob” concept, as well as the responsibilities of manufacturers, potential risks to passengers and other individuals at the crash scene. The model also incorporates constraints on vehicle longitudinal and lateral accelerations to ensure appropriate vehicle movement toward the collision target. Results indicate that the agent attempts to avoid hazardous situations whenever possible, prioritizing minor injuries when escape is impossible. In the most egoistic mode, the agent prioritizes passenger safety, while the highest level of altruism allows for potential harm to passengers to save those outside the vehicle. The results of the uncertainty analysis indicate that the model presented in this study is robust to noise in the environmental input and dropout in the convolutional neural network; although it should be adjusted for more sensitive conditions. The proposed model offers a practical framework for ethical decision-making in self-driving cars. The code is available at: https://github.com/ehsan-vakili/DQN-ethical-decision-making-self-driving-cars.",
    "synopsis": null,
    "relevance": null,
    "url": "https://doi.org/10.1016/j.eswa.2024.124569"
  },
  {
    "doi": "10.1115/1.4065649",
    "publication": "Journal of Electronic Packaging",
    "title": "Acoustic Characterization of Integrated Circuits During Operation1",
    "author": "Frankhouse J.",
    "publish_date": "2024-12-01",
    "abstract": "Power electronics are widely serving as core components of propulsion systems in electric vertical takeoff and landing (eVTOL) aircraft. Nevertheless, affected by the Paschen effect, the breakdown voltage of these electronics during flight is significantly lower than that on the ground, which could deteriorate system stability, or even cause aircraft faults or crashes, increasing safety risks for the public. As such, condition monitoring of power electronics has become critical for the safe operation of eVTOL. To achieve nonintrusive monitoring, acoustic emission (AE) sensors have gained traction with their prominent resistance to electromagnetic interference and high temperatures. However, existing studies yield conflicting results regarding whether an increase in loading voltage impacts the internal mechanical stress of electronics. To address this issue, we present this work to probe the existence and the pattern of a relationship between load voltage and stress wave, since the change of mechanical stress could generate acoustic waves that can be acquired by AE sensors. In this study, an AE sensor was applied onto an oscillator placed upon an epoxy substrate to characterize the acoustic waves emitted from the device under various input loads. In the experiment, we observed a unique AE signal pattern characterized by two distinct components that consistently intersect at a specific frequency. The time required to establish such intersections progressively lengthens as the load voltage increases. Through time-domain and frequency-domain analyses of the unique AE signals under different load voltages, it was discovered that certain features of the unique AE signals have an approximately linear relationship with the load voltage.",
    "synopsis": null,
    "relevance": null,
    "url": "https://doi.org/10.1115/1.4065649"
  },
  {
    "doi": "10.1186/s40621-024-00509-1",
    "publication": "Injury Epidemiology",
    "title": "Unintentional injury prevention in American Indian and Alaska Native communities: a scoping review of the Indian Health Service Primary Care Provider newsletter",
    "author": "Shields W.",
    "publish_date": "2024-12-01",
    "abstract": "Background: Unintentional injuries disproportionately impact American Indian and Alaska Native (AI/AN) populations. Developing effective and culturally tailored data collection and intervention programs requires an understanding of past prevention efforts in AI/AN communities, but limited peer-reviewed literature on the topic is available. This scoping review aims to summarize efforts that have been published in the Primary Care Provider newsletter, a source of gray literature available through the Indian Health Service. Methods: The research team obtained all injury related articles in the Provider newsletter and excluded those that did not describe an unintentional injury prevention effort. Included articles were organized chronologically and by topic, and outcomes were described in a data abstraction form. Results: A total of 247 articles from the Provider newsletter were screened, and 68 were included in this review. The most number of articles were published in 2007 (n = 15). Many focused not specifically on one tribal community but on the AI/AN community as a whole (n = 27), while others reported that certain tribes were the focus of study but did not identify tribes by name (n = 24). The following is a list of 14 tribal communities explicitly mentioned: Omaha, Cherokee, Ute, Yakama, Chippewa, Apache, Ho-Chunk, The Crow Tribe, Tohono O’odham Nation, Fort Mojave Tribe, Chemehuevi Tribe, The Rosebud Tribe, Navajo, and The Pueblo of Jemez. Published unintentional injury prevention efforts have covered the following 7 topics in AI/AN communities: falls, motor vehicle crashes, poisonings, improving data, burns, children, and other. Conclusion: This scoping review makes available and searchable information on injury prevention work conducted in and for AI/AN communities that is not currently found in the peer-reviewed literature.",
    "synopsis": null,
    "relevance": null,
    "url": "https://doi.org/10.1186/s40621-024-00509-1"
  },
  {
    "doi": "10.1186/s13068-024-02520-6",
    "publication": "Biotechnology for Biofuels and Bioproducts",
    "title": "Application of fed-batch strategy to fully eliminate the negative effect of lignocellulose-derived inhibitors in ABE fermentation",
    "author": "Branska B.",
    "publish_date": "2024-12-01",
    "abstract": "Background: Inhibitors that are released from lignocellulose biomass during its treatment represent one of the major bottlenecks hindering its massive utilization in the biotechnological production of chemicals. This study demonstrates that negative effect of inhibitors can be mitigated by proper feeding strategy. Both, crude undetoxified lignocellulose hydrolysate and complex medium supplemented with corresponding inhibitors were tested in acetone–butanol–ethanol (ABE) fermentation using Clostridium beijerinckii NRRL B-598 as the producer strain. Results: First, it was found that the sensitivity of C. beijerinckii to inhibitors varied with different growth stages, being the most significant during the early acidogenic phase and less pronounced during late acidogenesis and early solventogenesis. Thus, a fed-batch regime with three feeding schemes was tested for toxic hydrolysate (no growth in batch mode was observed). The best results were obtained when the feeding of an otherwise toxic hydrolysate was initiated close to the metabolic switch, resulting in stable and high ABE production. Complete utilization of glucose, and up to 88% of xylose, were obtained. The most abundant inhibitors present in the alkaline wheat straw hydrolysate were ferulic and coumaric acids; both phenolic acids were efficiently detoxified by the intrinsic metabolic activity of clostridia during the early stages of cultivation as well as during the feeding period, thus preventing their accumulation. Finally, the best feeding strategy was verified using a TYA culture medium supplemented with both inhibitors, resulting in 500% increase in butanol titer over control batch cultivation in which inhibitors were added prior to inoculation. Conclusion: Properly timed sequential feeding effectively prevented acid-crash and enabled utilization of otherwise toxic substrate. This study unequivocally demonstrates that an appropriate biotechnological process control strategy can fully eliminate the negative effects of lignocellulose-derived inhibitors. Graphical Abstract: (Figure presented.)",
    "synopsis": null,
    "relevance": null,
    "url": "https://doi.org/10.1186/s13068-024-02520-6"
  },
  {
    "doi": "10.1016/j.eswa.2024.124496",
    "publication": "Expert Systems with Applications",
    "title": "A quantum Lévy flight optimization based peripheral Yolov5 vison for scaling and optimizing autonomous train operations during transmission",
    "author": "Prabhu B.",
    "publish_date": "2024-12-01",
    "abstract": "In Autonomous Train (AT) operations, predicting future movements of trains to ensure the safety and efficiency of this public transport, is a critical task performed in the yard and terminal stations or between the source station/terminal and destination. Artificial Intelligence (AI) enabled Autonomous Vehicles (AVs) analyse their surroundings and make informed decisions based on the collected information. AVs learn their surroundings through perceptual motion, and predict the movements of various agents, such as humans, bicycles, and animals, through the prediction phase. If the predictions are accurate, AVs take proactive measures, making travel safer for everyone. However, the uncertainty in predicting agent/object's behaviour remains substantially difficult, despite significant research being conducted in this area. The objective of this study is to investigate the optimisation of AT Operations during Transmission (ATOT), with the goal of reducing wait times and ensuring safety even in the presence of obstacles, particularly animals. Quantum Lévy flight optimisation (QLFO) addresses these concerns on operational scalability of ATs. It generates real-time spatial data to make these operations efficient and to reduce the average waiting times. The YoLoV5 object recognition identifies the potential risks, such as individuals traversing rails or animals lying along the way and either rerouting or halting ATs to prevent crashes. The QLFO detects problems either before or after the train arrives at a junction or terminus and takes proactive measures using YoLov5 evaluation on the satellite image captured over the rail track. Evaluation experiments show that the proposed ATOT achieves a 9.3% reduction in the average waiting time spent.",
    "synopsis": null,
    "relevance": null,
    "url": "https://doi.org/10.1016/j.eswa.2024.124496"
  },
  {
    "doi": "10.1186/s12889-024-19118-0",
    "publication": "BMC Public Health",
    "title": "Estimating helmet wearing rates via a scalable, low-cost algorithm: a novel integration of deep learning and google street view",
    "author": "Li Q.",
    "publish_date": "2024-12-01",
    "abstract": "Introduction: Wearing a helmet reduces the risk of head injuries substantially in the event of a motorcycle crash. Countries around the world are committed to promoting helmet use, but the progress has been slow and uneven. There is an urgent need for large-scale data collection for situation assessment and intervention evaluation. Methods: This study proposes a scalable, low-cost algorithm to estimate helmet-wearing rates. Applying the state-of-the-art deep learning technique for object detection to images acquired from Google Street View, the algorithm has the potential to provide accurate estimates at the global level. Results: Trained on a sample of 3995 images, the algorithm achieved high accuracy. The out-of-sample prediction results for all three object classes (helmets, drivers, and passengers) reveal a precision of 0.927, a recall value of 0.922, and a mean average precision at 50 (mAP50) of 0.956. Discussion: The remarkable model performance suggests the algorithm’s capacity to generate accurate estimates of helmet-wearing rates from an image source with global coverage. The significant enhancement in the availability of helmet usage data resulting from this approach could bolster progress tracking and facilitate evidence-based policymaking for helmet wearing globally.",
    "synopsis": null,
    "relevance": null,
    "url": "https://doi.org/10.1186/s12889-024-19118-0"
  },
  {
    "doi": "10.1186/s40621-024-00508-2",
    "publication": "Injury Epidemiology",
    "title": "Diabetes mellitus and hard braking events in older adult drivers",
    "author": "Liu D.",
    "publish_date": "2024-12-01",
    "abstract": "Background: Diabetes mellitus (DM) can impair driving safety due to hypoglycemia, hyperglycemia, diabetic peripheral neuropathy, and diabetic eye diseases. However, few studies have examined the association between DM and driving safety in older adults based on naturalistic driving data. Methods: Data for this study came from a multisite naturalistic driving study of drivers aged 65–79 years at baseline. Driving data for the study participants were recorded by in-vehicle recording devices for up to 44 months. We used multivariable negative binomial modeling to estimate adjusted incidence rate ratios (aIRRs) and 95% confidence intervals (CIs) of hard braking events (HBEs, defined as maneuvers with deceleration rates ≥ 0.4 g) associated with DM. Results: Of the 2856 study participants eligible for this analysis, 482 (16.9%) reported having DM at baseline, including 354 (12.4%) insulin non-users and 128 (4.5%) insulin users. The incidence rates of HBEs per 1000 miles were 1.13 for drivers without DM, 1.15 for drivers with DM not using insulin, and 1.77 for drivers with DM using insulin. Compared to drivers without DM, the risk of HBEs was 48% higher for drivers with DM using insulin (aIRR 1.48; 95% CI: 1.43, 1.53). Conclusion: Older adult drivers with DM using insulin appear to be at increased proneness to vehicular crashes. Driving safety should be taken into consideration in DM care and management.",
    "synopsis": null,
    "relevance": null,
    "url": "https://doi.org/10.1186/s40621-024-00508-2"
  },
  {
    "doi": "10.1016/j.egycc.2024.100140",
    "publication": "Energy and Climate Change",
    "title": "Fossil fuel prices and economic policy uncertainty– A regime-switching approach",
    "author": "Ayinde T.O.",
    "publish_date": "2024-12-01",
    "abstract": "The study investigates the impact of fossil fuel prices on the regime-switching dynamics of economic policy uncertainty for the global economy. The period of investigation spans 25 years; comprising monthly data for the period of 1998:01 to 2023:03 and, due to its propensity to accommodate shocks, swings and shifts in the data, the technique of analysis employed is the Markov Switching Dynamic Regression. The principal component analysis (PCA) method was used in obtaining a composite index for the fossil fuel prices. The results obtained show evidence of regime-switching behaviour with five (5) times persistence of low to high global economic policy uncertainty. In addition, the study finds significant counter-cyclical and pro-cyclical effects of fossil fuel prices on global economic policy uncertainty; especially under the regime of high uncertainty. These results are consistent with the results for the composite index of fossil fuel prices but with alternate persistence effects. These suggest that policymakers should be concerned in stabilizing fluctuating fossil fuel prices in order to contain its spiralling and uncertain effects on the global economic policy. More so, governments should devise series of low carbon-emission means for home and industrial uses to ultimately reduce the excessive demand for fossil fuel so as to crash its prices in the international market.",
    "synopsis": null,
    "relevance": null,
    "url": "https://doi.org/10.1016/j.egycc.2024.100140"
  },
  {
    "doi": "10.1038/s41598-024-63026-7",
    "publication": "Scientific Reports",
    "title": "Scheduling optimisation of alcohol test sites",
    "author": "Yu H.",
    "publish_date": "2024-12-01",
    "abstract": "Drink driving is an infamous factor in road crashes and fatalities. Alcohol testing is a major countermeasure, and random breath tests (RBTs) deter tested drivers and passersby (observers who are not tested). We propose a genetic algorithm (GA)-based RBT scheduling optimisation method to achieve maximal deterrence of drink driving. The RBT schedule denotes the daily plan of where, when, and for how long tests should occur in the road network. The test results (positive and negative) and observing drivers are considered in the fitness function. The limited testing resource capacity is modeled by a number of constraints that consider the total duration of tests, the minimum and maximum duration of a single test site, and the total number of test sites during the day. Clustering of the alcohol-related crash data is used to estimate the matrix for drink driving on the scheduled day. The crash data and traffic flow data from Victoria, Australia are analysed and used to describe sober/drink driving. A detailed synthetic example is developed and a significant improvement with 150% more positive results and 59% more overall tests is observed using the proposed scheduling optimisation method.",
    "synopsis": null,
    "relevance": null,
    "url": "https://doi.org/10.1038/s41598-024-63026-7"
  }
]